// - Дано натуральное число n. Выведите все числа от 1 до n.


// - Даны два целых числа A и В . Выведите все числа от A до B
// включительно, в порядке возрастания, если A < B, или в порядке
// убывания в противном случае.

// function fn (a, b){
//     let arr=[]
//      if (+a <= +b) {
//          for (let i = a, j = 0; i <= b; i++, j++) {
//              arr[j] = i
//          }
//      }
//      else if (+a > +b) {
//          for (let i = a,j=0; i >= b;j++, i--) {
//              arr[j]=i;
//          }
//      }
//          return arr
// }
//
// console.log(fn(10, 20));


// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]

// function fn(arr, i) {
//     let temp = arr[i];
//     arr[i] = arr[i + 1];
//     arr[i + 1] = temp;
//     return arr;
// }
//
// console.log(fn([3, 4, 5, 6, 7, 8, 9, 0], 2));


// - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// EXAMPLE:
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]


function fn (arr) {
    let arrNum = [];
    let arrNull = [];
    let allArr = [];

    for (let i = 0, j = 0, k = 0; i < arr.length; i++) {

        if (arr[i] === 0){
            arrNull[j] = arr[i];
            j++;

        }else {
            arrNum[k] = arr[i];
            k++;
        }
    }
    allArr = arrNum.concat(arrNull);
    console.log(allArr);
}

fn([1, 0,2,0,3,0,4,5,6,0,0,6,0,7,0,8,0]);





